{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 13,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 64,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": []
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          13
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          14
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Sequence",
    "decoders": []
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "#": 0,
      "(": 1,
      ")": 2,
      "-": 3,
      "/": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "<BOS>": 13,
      "<EOS>": 14,
      "=": 15,
      "Br": 16,
      "C": 17,
      "Cl": 18,
      "F": 19,
      "I": 20,
      "N": 21,
      "O": 22,
      "P": 23,
      "S": 24,
      "[C@@H]": 25,
      "[C@@]": 26,
      "[C@H]": 27,
      "[C@]": 28,
      "[CH-]": 29,
      "[CH2-]": 30,
      "[N+]": 31,
      "[N-]": 32,
      "[NH+]": 33,
      "[NH-]": 34,
      "[NH2+]": 35,
      "[NH3+]": 36,
      "[O+]": 37,
      "[O-]": 38,
      "[OH+]": 39,
      "[P+]": 40,
      "[P@@H]": 41,
      "[P@@]": 42,
      "[P@]": 43,
      "[PH+]": 44,
      "[PH2]": 45,
      "[PH]": 46,
      "[S+]": 47,
      "[S-]": 48,
      "[S@@+]": 49,
      "[S@@]": 50,
      "[S@]": 51,
      "[SH+]": 52,
      "[n+]": 53,
      "[n-]": 54,
      "[nH+]": 55,
      "[nH]": 56,
      "[o+]": 57,
      "[s+]": 58,
      "\\": 59,
      "c": 60,
      "n": 61,
      "o": 62,
      "s": 63,
      "<PAD>": 64,
      "<UNKNOWN>": 65
    },
    "unk_token": "<unk>"
  }
}