{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 42,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 43,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 100,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": []
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          42
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          43
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Sequence",
    "decoders": []
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "$": 0,
      ",": 1,
      "-": 2,
      ".": 3,
      "1": 4,
      "10": 5,
      "11": 6,
      "12": 7,
      "13": 8,
      "14": 9,
      "15": 10,
      "16": 11,
      "17": 12,
      "18": 13,
      "19": 14,
      "2": 15,
      "20": 16,
      "21": 17,
      "22": 18,
      "23": 19,
      "24": 20,
      "25": 21,
      "26": 22,
      "27": 23,
      "28": 24,
      "29": 25,
      "3": 26,
      "30": 27,
      "31": 28,
      "32": 29,
      "33": 30,
      "34": 31,
      "35": 32,
      "37": 33,
      "38": 34,
      "4": 35,
      "5": 36,
      "6": 37,
      "7": 38,
      "8": 39,
      "9": 40,
      ":": 41,
      "<BOS>": 42,
      "<EOS>": 43,
      "A": 44,
      "C": 45,
      "D": 46,
      "E": 47,
      "F": 48,
      "G": 49,
      "H": 50,
      "I": 51,
      "K": 52,
      "L": 53,
      "M": 54,
      "N": 55,
      "P": 56,
      "PEPTIDE1": 57,
      "PEPTIDE2": 58,
      "Q": 59,
      "R": 60,
      "R1": 61,
      "R2": 62,
      "R3": 63,
      "S": 64,
      "T": 65,
      "V": 66,
      "W": 67,
      "Y": 68,
      "[Abu]": 69,
      "[Glp]": 70,
      "[Nal]": 71,
      "[Nle]": 72,
      "[Nva]": 73,
      "[Orn]": 74,
      "[Sar]": 75,
      "[ac]": 76,
      "[am]": 77,
      "[dA]": 78,
      "[dC]": 79,
      "[dD]": 80,
      "[dE]": 81,
      "[dF]": 82,
      "[dH]": 83,
      "[dI]": 84,
      "[dK]": 85,
      "[dL]": 86,
      "[dM]": 87,
      "[dN]": 88,
      "[dP]": 89,
      "[dQ]": 90,
      "[dR]": 91,
      "[dS]": 92,
      "[dT]": 93,
      "[dV]": 94,
      "[dW]": 95,
      "[dY]": 96,
      "{": 97,
      "|": 98,
      "}": 99,
      "<PAD>": 100,
      "<UNKNOWN>": 101
    },
    "unk_token": "<unk>"
  }
}